import { genTime } from '../genTime';

const model = [
    '12:00',
    '12:15',
    '12:30',
    '12:45',
    '13:00',
    '13:15',
    '13:30',
    '13:45',
    '14:00',
    '14:15',
    '14:30',
    '14:45',
    '15:00',
    '15:15',
    '15:30',
    '15:45',
    '16:00',
    '16:15',
    '16:30',
    '16:45',
    '17:00',
    '17:15',
    '17:30',
    '17:45',
];

describe('Тест функции genTime', () => {
    it('Функция должна правильно создать правильный массив', () => {
        const array = genTime();
        expect(array).toEqual(expect.arrayContaining(model));
    });
});
